<template>
  <div class="home container">
    <div class="home_head">
      <div class="home_head-title">
        Что есть какао?
      </div>
      <div class="home_head-desc">
      Какао называют напиток из какао-бобов.
      В качестве основы используют воду или молоко, добавляют сахар по вкусу.
      Но это очень общее представление, которое здесь будет расширено.
      <br>
      Помимо использования обработанных плодов какао для создания шоколадных напитков
      используется кэроб – самая распространённая альтернатива какао бобов.
      Собой он представляет плоды рожкового дерева и обладает более насыщенным вкусом.
      <br>
      В настоящее время в сфере обслуживания засилье заведений, подающих разные виды кофе
      и топпингов к ним. В подобных заведениях также есть возможность заказать себе
      какао или горячий шоколад, но зачастую именно этими двумя позициями
      ограничивается меню, а качество напитков оставляет желать лучшего.
      <br>
      Рецепты шоколадных напитков в кофейнях зачастую ограничивается ранее упомянутым способом:
      разведение какао-порошка в кипятке, возможно с добавлением молока.
      Разница между горячим шоколадом также будет едва ощутима, даже неискушённым потребителем.
      <br>
      Предлагаю разрушить стереотипы о шоколадных напитках и вывести их из тени кофе,
      разобравшись в тонкостях приготовления.
      <br>
      </div>
    </div>

    <div class="home_nav">
      <ul class="home_nav-main">
        <li v-for="link in nav" :key="link.name">
        <a href="#" @click="scroll(link.name)">{{link.text}}</a>
          <ul class="home_nav-sub" v-if="link.child">
            <li v-for="sublink in link.child" :key="sublink.name">
              <a href="#" @click="scroll(sublink.name)">{{ sublink.text }}</a>
            </li>
          </ul>
        </li>
      </ul>
    </div>

    <div class="home_advice">
      <advice-vue
      v-for="advice in advices"
      :key="advice.name"
      :title="advice.title"
      :text="advice.text"
      :ref="advice.name">
      </advice-vue>
    </div>

    <div class="home_recipes">
      <recipes-vue v-for="(recipe, index) in recipes"
      :key="index"
      :recipe="recipe">
      </recipes-vue>
    </div>

  </div>
</template>

<script>
import adviceVue from '@/components/advice.vue';
import recipesVue from '@/components/recipes.vue';

export default {
  name: 'HomeView',
  components: { adviceVue, recipesVue },
  data: () => ({

  }),

  computed: {
    nav() {
      return [
        {
          text: 'Вода или молоко',
          name: 'water',
        },
        {
          text: 'Сама какава',
          name: 'cacao',
          child: [
            {
              text: 'Какао бобы',
              name: 'cacao_boba',
            },
            {
              text: 'Кэроб',
              name: 'caroba',
            },

          ],
        },
        {
          text: 'Доп штучки',
          name: 'toppings',
        },
        {
          text: 'Рецепты',
          name: 'recipes',
        },
      ];
    },

    advices() {
      return [
        {
          title: 'Вода или молоко',
          name: 'water',
          text: 'У методов приготовления шоколадных напитков с использованием воды есть свои плюсы и минус, также, как и у молока и их сочетаний.\n'
          + 'Вопрос «что же лучше использовать» на деле является делом вкуса, так что я постараюсь описать собственный опыт.'
          + '</br>'
          + 'Использование молока позволит добиться мягкого вкуса. При нагревании молока необходимо следить за тем, чтобы оно не «сбежало».'
          + '</br>'
          + 'При варке напитка на воде, он получается более терпким и готовится проще, чем на молоке – нет необходимости следить за кастрюлей или туркой.',
        },
        {
          title: 'Сама какава',
          name: 'cacao',
          text: 'Как было упомянуто ранее, две самые распространённые основы шоколадного напитка,\n'
          + 'это измельчённые плоды какао и рожкового дерева. Поподробнее о них:',
        },
        {
          title: 'Какао бобы',
          name: 'cacao_boba',
          text: 'Основная причина любви к какао – содержание в нём дофамина, гормона счастья. '
          + 'Употребление шоколадного напитка на основе какао можно сравнить с употреблением шоколада, как бы это ни было удивительно.'
          + '</br>'
          + 'Также в нём много антиоксидантов, что положительно сказывается на биологическом возрасте организма. Не источник вечной молодости, но всё же.'
          + '</br>'
          + 'Полифенолы стимулируют кровообращение в мозгу, улучшают память и работу мозга. '
          + 'Это одна из причин, по которым какао рекомендуют к употреблению школьникам и студентам.'
          + '</br>'
          + 'Если не злоупотреблять напитком, можно избежать получения вреда от какао, однако стоит упомянуть и опасности злоупотребления.'
          + '</br>'
          + 'Максимальная норма для «среднего человека» - не более двух кружек в день. '
          + 'В случае её превышения, могут наблюдаться следующие побочные эффекты: аллергия, привыкание, бессонница.'
          + '</br>'
          + 'Также какао весьма калорийно, к чему тоже необходимо относиться с осторожностью.'
          + '</br>',
        },
        {
          title: 'Кэроб',
          name: 'caroba',
          text: 'Диковинный на территории России фрукт(это шутка, рожковое дерево относится к семейству бобовых). '
          + 'Технология его обработки разветвляется после высушивания.'
          + '</br>'
          + 'Бобы могут быть обжарены, а могут оставаться сырыми. Именно сырой кэроб считается более '
          + 'полезным, так как при обжарке распадаются сахара и другие ценные вещества.'
          + '</br>'
          + 'Светлый кэроб отличается нежным вкусом с ореховой ноткой, бежевато-розовым оттенком и выраженной сладостью. '
          + 'Слегка обжаренные зерна дают порошок с ароматом карамели и легкой кислинкой, похожей на кофейную. Продукт имеет охровый оттенок.'
          + '</br>'
          + 'Среднеобжаренные бобы приобретают благородную горечь, как у темного шоколада и коричневый цвет – примерно, как у какао-порошка. '
          + 'Чем дольше бобы поддаются термической обработке, тем менее сладкими они становятся. '
          + 'При этом продукт сохраняет свои антиоксидантные и другие полезные свойства.'
          + '</br>'
          + 'По антиоксидантам всё понятно – и тут есть, и в какао. А в чём тогда различие?'
          + '</br>'
          + 'Бобы рожкового дерева содержат много клетчатки, отчего снижают чувство голода. '
          + 'Вкупе с высоким содержанием сахара кэроб способствует преодолеть приступы голода.'
          + '</br>'
          + 'Употребление кэроба снижает уровень холестерина и очищает кровь, '
          + 'нормализует давление и сердечный ритм. Рекомендовано для гипертоников.'
          + '</br>'
          + 'Также кальций кэроба качественно усваивается организмом, укрепляя скелет.'
          + '</br>'
          + 'Один из важнейших плюсов – кэроб нормализует сон и настроение, помогает '
          + 'избавиться от кофейной и шоколадной(какао) зависимости.'
          + '</br>'
          + 'У бобов рожкового дерева специалистами не выявлено выраженного '
          + 'вредоносного действия. Единственная опасность употребления кэроба – '
          + 'передозировка и аллергия.'
          + '</br>'
          + 'По всем пунктам – идеальный напиток. В чём же подвох?'
          + '</br>'
          + 'В удобстве. В России получить кэроб можно преимущественно в интернет-магазинах '
          + 'магазинах, по типу Ozon. '
          + '</br>',
        },
        {
          title: 'Топпинги',
          name: 'toppings',
          text: 'Одна из самых интересных тем – добавки к какао, влияющие на его вкус. '
          + '</br>'
          + 'Поскольку кофе в настоящий момент доминирует на рынке, никто особо не '
          + 'задумывается, как можно манипулировать вкусом и сервировкой какао-напитка. '
          + 'Самое частое – добавить к готовому напитку зефир. '
          + 'Далее, в «рецептах» будут приведены примеры готовки практически всех советов.'
          + '</br>'
          + 'Однако в Мексике готовят какао с добавлением красного перца. Но начнём с чего-то более в простого.'
          + '</br>'
          + 'Если вы любитель ванили, то знаете, что с ней нужно обращаться аккуратно.'
          + 'Чтобы не перебить вкус напитка на одну порцию (примерно 200-250 мл) будет достаточно пары капель ванильного экстракта. '
          + 'Также для сервировки можно использовать взбитые сливки.'
          + '</br>'
          + 'В горячий шоколад или какао можно добавлять бананы, и, в отличии от очень сильной ванили, '
          + 'здесь вы можете более тонко регулировать баланс вкуса тропической ягоды (банан - ягода) и шоколадных бобов.'
          + '</br>'
          + 'Лично мой фаворит – какао с мёдом вместо сахара и сервированное шариком мороженого. '
          + 'Подтаяв, мороженное создаст границу холодных сливок и горячего напитка, одновременно остужая его и смешиваясь со вкусом какао.'
          + '</br>'
          + 'Также существует вариация какао с тыквой, но о ней поподробнее в рецептах.',
        },
        {
          title: 'Рецепты',
          name: 'recipes',
          text: '',
        },
      ];
    },

    recipes() {
      return [
        {
          title: 'Мексиканский вариант',
          text: 'Как и обещал, какао по-мексикански: жгучий, пикантный и ароматный. Он подойдёт на случай, если вы хотите согреться или испытать острых ощущений. ',
          ingredients: [
            'столовая ложка с горкой классического какао в порошке;',
            'полный стакан молока;',
            'две чайных ложки сахара (лучше коричневого, но подойдёт и обычный);',
            'треть чайной ложки ванильного экстракта (или пакетик натурального ванилина);',
            'щепотка соли;',
            'щепотка молотой корицы;',
            'щепотка молотого перца чили, паприки или кайенского перца;',
            'щепотка мускатного ореха (по желанию).',
          ],
          steps: [
            'Молоко влейте в любую толстодонную ёмкость, нагрейте до 50 градусов.',
            'Далее всыпайте в горячее молоко все компоненты, при этом активно помешивая всё венчиком или ложкой, чтобы не появлялись комки.',
            'Доводите смесь до кипения, остужайте до комфортной температуры и подавайте.',
          ],
        },
        {
          title: 'Шоколадный кофе мокка',
          text: 'Дабы не прослыть кофе-ненавистником, представляю вашему вниманию компромисс: слияние кофе и какао с добавлением ванили.',
          ingredients: [
            '120 мл крепкого кофе (из машины или из турки)',
            '100 мл цельного молока жирностью от 3,2%',
            '2 ст. л. какао-порошка без сахара + еще немного для подачи',
            'сахар, по желанию',
            'пара капель ванильного экстракта',
            'взбитые сливки для подачи',
          ],
          steps: [
            'Смешайте холодное (комнатной температуры) молоко с какао, сахаром, если используете, и ванилью, помешивая, доведите до кипения. ',
            'Одновременно сварите кофе.',
            'Влейте шоколадное молоко в высокую кружку, затем добавьте кофе. ',
            'Выложите взбитые сливки, припудрите какао и подавайте.',
          ],
        },
        {
          title: 'Банановое какао',
          text: 'Этот вариант напитка разнообразит ваши вкусовые ощущения от классического какао.',
          ingredients: [
            'четыре полных стакана молока;',
            'четверть стакана порошкового какао;',
            'два банана;',
            'по желанию немного сахара (необязательно - молоко и бананы придадут напитку лёгкую сладость).',
          ],
          steps: [
            'Молоко подогревайте в любой огнеупорной и желательно толстодонной ёмкости.',
            'Всыпайте в горячее молоко какао, нагревайте смесь на медленном огне и доводите до кипения, постоянно перемешивая (чтобы какао не образовало комки).',
            'Далее очищайте от кожуры бананы и измельчите их в блендере.',
            'Банановое пюре вводите в какао с молоком, по желанию добавляйте небольшое количество сахара и всё вместе взбивайте блендером.',
            'Предлагайте детям напиток.',
          ],
        },
        {
          title: 'Горячий шоколад с мороженным',
          text: 'Мой любимчик, не требующий лишних слов. Этот рецепт может быть воссоздан в двух вариациях: с холодным или горячим какао-напитком. Различие лишь в том, что для горячей версии не охлаждается напиток.',
          ingredients: [
            '1 стакан молока;',
            '2 столовые ложки какао-порошка;',
            '2-3 столовые ложки мёда(по вкусу);',
            '100 грамм сливочного мороженого.',
          ],
          steps: [
            'Сварить какао на молоке, всыпая в горячее молоко какао, добавив мёд после полного растворения порошка. Охладить.',
            'В высокие стаканы или бокалы положить мороженое, залить холодным какао и подавать.',
          ],
        },
        {
          title: 'Какао с вишней',
          text: 'Мой любимчик, не требующий лишних слов. Этот рецепт может быть воссоздан в двух вариациях: с холодным или горячим какао-напитком. Различие лишь в том, что для горячей версии не охлаждается напиток.',
          ingredients: [
            '1 столовая ложка какао-порошка;',
            '0,5 стакана молока;',
            '50 грамм пломбира;',
            '1 столовая ложка сахара;',
            '0,5 стакана вишневого нектара;',
            'молотая корица на кончике ножа.',
          ],
          steps: [
            'Сварить какао вместе с молоком и сахаром. Дать напитку остыть;',
            'Готовый коктейль налить в стакан. Сверху положить шарик мороженого. Посыпать корицей.',
          ],
        },
        {
          title: 'Какао с тыквой',
          text: 'Этот рецепт весьма необычен, но наверняка найдётся люди, которым он придётся по вкусу.',
          ingredients: [
            'два стакана молока (500 мл.);',
            'пять столовых ложек порошкового классического какао (без добавления сахара);',
            '150 граммов тыквы (лучше всего сладкой, например, мускатной);',
            'чайная ложка молотой корицы;',
            'щепотка молотого имбирного корня;',
            'пять столовых ложек коричневого сахара.',
          ],
          steps: [
            'Тыкву очищайте от семечек и кожуры, режьте любыми кусочками и заливайте молоком;',
            'Тыкву в молоке варите в толстодонной ёмкости до полной готовности (размягчения);',
            'Добавляйте в молоко с тыквой корицу, порошок какао, сахар и имбирь. Всё это вместе варите ещё минуту;',
            'Далее снимайте ёмкость с огня и её содержимое измельчайте с помощью блендера до однородной консистенции;',
            'Готово, какао с тыквой можно подавать,',
          ],
        },
      ];
    },
  },

  methods: {
    scroll(name) {
      const item = this.$refs[name][0];
      window.scrollTo({ top: item.$el.offsetTop, behavior: 'smooth' });
    },
  },
};
</script>

<style lang="scss" scoped>
  .home{
     &_head{
      &-title{
        font-size: 30px;
        font-weight: bold;
        font-family: 'Courier New', Courier, monospace;//менять шрифт класса
        margin-bottom: 15px;
      }
      &-desc{
        font-size: 18px;
      }
    }

    &_nav{
      a{
        color: mediumaquamarine;
      }
      &-main{
        padding-left: 20px;
      }
      &-sub{
      a{
        text-decoration-line: none;
      }
      }
    }

  }
</style>
